betfair/templates/aus/BFExchangeService.getMUBets.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/exchange/v5/'
xmlns:ns1='http://www.betfair.com/publicapi/v5/BFExchangeService/'>
<SOAP-ENV:Body>
<ns1:getMUBets>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<betStatus>U</betStatus>
<marketId>0</marketId>
<betIds>
<ns2:betId>0</ns2:betId>
<ns2:betId>0</ns2:betId>
</betIds>
<orderBy>NONE</orderBy>
<sortOrder>DESC</sortOrder>
<recordCount>0</recordCount>
<startRecord>0</startRecord>
<matchedSince>2012-05-16T18:47:03Z</matchedSince>
<excludeLastSecond>false</excludeLastSecond>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:getMUBets>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
